import sqlite3

connection = sqlite3.connect('game_portal.db')

cursor = connection.cursor()

cursor.execute(
    '''CREATE TABLE users(
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        username VARCHAR(30) NOT NULL UNIQUE,
        password VARCHAR(30) NOT NULL
    )
    '''
)

cursor.execute(
    '''CREATE TABLE game_statistics(
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        user_id INTEGER NOT NULL,
        max_score INTEGER,
        total_draws INTEGER,
        total_loses INTEGER,
        total_wins INTEGER,
        FOREIGN KEY(user_id) REFERENCES users(id)
    )
    '''
)

cursor.execute(
    '''CREATE TABLE games(
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        user_id INTEGER NOT NULL,
        game_name VARCHAR(50) NOT NULL,
        date_played DATETIME,
        guessed_questions INTEGER,
        money_won INTEGER,
        win INTEGER,
        loss INTEGER,
        draw INTEGER,
        FOREIGN KEY(user_id) REFERENCES users(id)
    )

    '''
)

cursor.execute(
    '''CREATE TABLE questions(
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        question VARCHAR(150) NOT NULL,
        correct_answer VARCHAR(50) NOT NULL,
        second_option VARCHAR(50) NOT NULL,
        third_option VARCHAR(50) NOT NULL,
        fourth_option VARCHAR(50) NOT NULL,
        difficulty VARCHAR(25) NOT NULL
    )

    '''
)

questions_data = [
    ("Къде обичайно се ходи с кепче и захранка?", "На риболов", "На изпит", "На дискотека", "На избори","easy"),
    ("Кой камък е станал символ на препятствие на пътя към целта?", "Препъни-камъкът", "Лунният камък", "Камъкът в пазвата", "фФилософският камък","easy"),
    ("Кое е сладкиш, носещ името на град в Австрия?", "Линцер", "Канола", "Канцлер", "Фузили","easy"),
    ("Какво се стреми да покаже човекът, който изглежда така, сякаш е \"ни лук ял, ни лук мирисал\"?", "Незнание и невинност", "Аристократичност", "Имунитет срещу Ковид", "Вегетарианска добродетел","easy"),
    ("Кое от следните на ден може да намали риска от смърт с над 50% през следващите 10 години според учените?", "7000 извървени крачки", "7 големи ракии", "700 грама шоколад", "70 минути в задръстване","easy"),
    ("Представителите на кой от древните народи са носили туника?", "Римляни", "Викинги", "Гали", "Индианци","easy"),
    ("В какви цветове са клавишите на пианото?", "Черно и бяло", "Синьо и жълто", "Червено и черно", "Розово и кафяво","easy"),
    ("Къде официално се употребява изразът \"оставам на разположение\"?", "Служебна кореспонденция", "Партийна централа", "Полицейско управление", "Салон за масажи","easy"),
    ("Кои дейци се явяват участници в движение, което се бори за предоставяне на избирателни права на жените?", "Суфражетки", "Еколози", "Пацифисти", "Дарвинисти","easy"),
    ("Кое е най-характерно за човека, определян като перфекционист?", "Държи на съвършенството", "Има перфектни палци", "Вегетарианец е", "Обича малиново кафе","easy"),
    ("Коя маса обикновено има джобове?", "Билярдната", "Шведската", "Кухненската", "Тенисната","easy"),

    ("Къде в България се намира областта Краище?", "Западна", "Северна", "Южна", "Източна", "medium"),
    ("Кой от продуктите съдържа танин?", "Червено вино", "Шоколад", "Мляко", "Сирене", "medium"),
    ("Колко прости числа има в диапазона от 1 до 10?", "Четири", "Две", "Шест", "Десет", "medium"),
    ("В емблемата на кой футболен клуб има изобразен кръстът на свети Георги?", "Барселона", "Ювентус", "Манчестър Юнайтед", "Байерн Мюнхен", "medium"),
    ("Какво се е добивало в Окло - единственото място в света, където е протичала естествена ядрена реакция?", "Уран", "Платина", "Мрамор", "Сол", "medium"),
    ("Какъв е надписът, който образуват специално засадените през 1981г. дръвчета край русенското село Обретеник?", "1300", "СССР", "Мир", "БКП", "medium"),
    ("До кой град е имало редовна въздушна линия на БГА 'Балкан' до 1989г.?", "София-Видин", "София-Петрич", "София-Пазарджик", "София-Смолян", "medium"),
    ("Какво липсва в първия телефонен указател?", "Телефонни номера", "Година на издаване", "Имена на хора", "Работно време", "medium"),
    ("Кое растение вдъхновява швейцарския инженер Жорж дьо Местрал за изобретяването на велкрото?", "Репей", "Живовляк", "Коприва", "Ръж", "medium"),
    ("Кое е петото име, ако останалите четири са Симона, Лаура, Ерика, Стефани?", "Мадлен", "Катрин", "Леонор", "Галатея", "medium"),
    ("Как западните дипломати наричат 'портата' в Цариград, където се е ковала политиката на империята?", "Високата", "Султанската", "На слънцето", "На полумесеца", "medium"),
    ("Коя от държавите не участва в тристранния пакт за сигурност AUKUS?", "Франция", "Австралия", "САЩ", "Великобритания", "medium"),

    ("Чии са последните думи: 'Измамена. Младост. Прошка. Сън. Спомен. Зад стените на голямата къща. ТАЙНА'?", "Петя Дубарова", "Тодор Александров", "Никола Вапцаров", "Елисавета Багряна", "hard"),
    ("Първата уеб камера е измислена и сложена в Кеймбриджкия университет с цел да скрият кой:", "Оставя кафеварката празна", "Изяжда бисквитите", "Не гаси лампите", "Не си мие чашите", "hard"),
    ("Стихотворение на кого е изписано върху седем страници в тефтерчето на Васил Левски?", "Ботев", "Вазов", "Чинтулов", "П.Р. Славейков", "hard"),
    ("Какъв екзотичен плод получава от главния си градинар английският крал Чарлз II, запечатан в картина?", "Ананас", "Драконов плод", "Портокал", "Личи", "hard"),
    ("Коя държава приема първата конституция с разделение на властите в Европа през XVIII век?", "Полско-литовската държава", "Исландия", "Венеция", "Великобритания", "hard"),
    ("На кой апостол Иисус Христос поверява грижите за Богородица?", "Йоан", "Матей", "Петър", "Андрей", "hard"),
    ("С коя дума Данте завършва всяка една от трите части на 'Божествената комедия' - 'Ад', 'Рай' и 'Чистилище'?", "Звезди", "Създател", "Небе", "Надежда", "hard"),
    ("На коя държава принадлежи единственото национално знаме с различни лицева и обратна страна?", "Парагвай", "Латвия", "Пакистан", "Либерия", "hard")
]   

for question in questions_data:
    cursor.execute('''INSERT INTO questions(question, correct_answer, second_option, third_option, fourth_option, difficulty) VALUES (?, ?, ?, ?, ?, ?)''', question)

connection.commit()
connection.close()